//======================================================================
//											CComponentLayoutBase.cpp
//	コンポーネント作成用のベースレイアウト
//
//======================================================================
//	author :	AT12A 05 宇佐美晃之
//======================================================================
//	開発履歴
//	2020/11/16	作成
//
//======================================================================


//===== インクルード部 =====
#include "CComponentLayoutBase.h"

//===== マクロ定義 =====


//===== プロトタイプ宣言 =====


//===== グローバル変数 =====


//===================================
//
//	スタート関数
//
//===================================
void CComponentLayoutBase::Start()
{

}


//===================================
//
//	更新関数
//
//===================================
void CComponentLayoutBase::Update()
{

}


//===================================
//
//	後更新関数
//
//===================================
void CComponentLayoutBase::LateUpdate()
{

}


//===================================
//
//	終了関数
//
//===================================
void CComponentLayoutBase::End()
{

}


//===== 使わない時は消してください() =====
//===================================
//
//	2D当たり判定(Enter) コールバック関数
//
//===================================
void CComponentLayoutBase::OnCollisionEnter2D(const std::shared_ptr <CCollision2D>& collsion2d)
{
	// タグなどで判定
	if (collsion2d)
	{

	}
}

