//======================================================================
//												CContenueObj.h
//	エンディングの文字用オブジェクト
//
//======================================================================
//	author :	AT12A 15 榊原龍我
//======================================================================
//	開発履歴
//	2021/01/22 作成
//
//======================================================================
#pragma once


//====== インクルード部 ======
#include "CSpriteObject.h"


//===== 構造体定義 =====


//===== クラス定義 =====
class CContenueObj : public CSpriteObject
{
public:
	CContenueObj();
	~CContenueObj();
protected:

private:
};


//===== プロトタイプ宣言 =====


