//======================================================================
//												CDamageTrapObj.h
//	ダメージトラップ
//
//======================================================================
//	author :	AT12A 15 榊原龍我
//======================================================================
//	開発履歴
//	2020/12/13	作成
//
//======================================================================
#pragma once


//====== インクルード部 ======
#include "CBillboardObject.h"


//===== 構造体定義 =====


//===== クラス定義 =====
class CDamageTrapObj : public CObject
{
public:
	CDamageTrapObj();
	~CDamageTrapObj();
protected:

private:
};


//===== プロトタイプ宣言 =====


