//======================================================================
//												CDropObject.h
//	プレイヤーがのったら落ちるやつ
//
//======================================================================
//	author :	AT12A 20 土屋美月
//======================================================================
//	開発履歴
//	2020/12/08	作成
//
//======================================================================
#pragma once


//====== インクルード部 ======
#include "CAssimpObject.h"


//===== 構造体定義 =====


//===== クラス定義 =====
class CDropObject : public CAssimpObject
{
public:
	CDropObject();
	~CDropObject();
protected:

private:
};


//===== プロトタイプ宣言 =====


