//======================================================================
//												CEditorModeObj.h
//	タイトルメニューのエディタモード用オブジェクト
//
//======================================================================
//	author :	AT12A 15 榊原龍我
//======================================================================
//	開発履歴
//	2021/01/19	作成
//
//======================================================================
#pragma once


//====== インクルード部 ======
#include "CSpriteObject.h"


//===== 構造体定義 =====


//===== クラス定義 =====
class CEditorModeObj : public CSpriteObject
{
public:
	CEditorModeObj();
	~CEditorModeObj();
protected:

private:
};


//===== プロトタイプ宣言 =====


