//======================================================================
//												CElevatorRoadEnd.h
//	エレベーターロードエンド
//
//======================================================================
//	author :	AT12A 05 宇佐美晃之
//======================================================================
//	開発履歴
//	2020/12/05	作成
//
//======================================================================
#pragma once


//====== インクルード部 ======
#include "CAssimpObject.h"


//===== 構造体定義 =====


//===== クラス定義 =====
class CElevatorRoadEnd : public CAssimpObject
{
public:
	CElevatorRoadEnd();
	~CElevatorRoadEnd();
protected:

private:
	
}; 


//===== プロトタイプ宣言 =====


#pragma once
