//======================================================================
//												CEndingPicObj.h
//	エンディング用の荒廃世界のオブジェクト
//
//======================================================================
//	author :	AT12A 05 宇佐美晃之
//======================================================================
//	開発履歴
//	2020/11/16	作成
//
//======================================================================
#pragma once


//====== インクルード部 ======
#include "CSpriteObject.h"


//===== 構造体定義 =====


//===== クラス定義 =====
class CEndingPicObj : public CSpriteObject
{
public:
	CEndingPicObj();
	~CEndingPicObj();
protected:

private:
};


//===== プロトタイプ宣言 =====


