//======================================================================
//											CGearCaterpillarComponent.h
//	ギア・キャタピラ同期コンポーネント
//
//======================================================================
//	author :	AT12A 05 宇佐美晃之
//======================================================================
//	開発履歴
//	2021/01/20	作成
//
//======================================================================


//===== インクルード部 =====
#include "CGearCaterpillarComponent.h"

//===== マクロ定義 =====


//===== プロトタイプ宣言 =====


//===== グローバル変数 =====


//===================================
//
//	スタート関数
//
//===================================
void CGearCaterpillarComponent::Start()
{

}


//===================================
//
//	更新関数
//
//===================================
void CGearCaterpillarComponent::Update()
{

}


//===================================
//
//	後更新関数
//
//===================================
void CGearCaterpillarComponent::LateUpdate()
{
	const auto& player = m_player.lock();
	if (!player) return;

	// 座標の同期
	m_pParent->m_pTrans->m_pos = m_player.lock()->m_pos;
	m_pParent->m_pTrans->m_rot = m_player.lock()->m_rot;
	m_pParent->m_pTrans->m_scale = m_player.lock()->m_scale;
}


//===================================
//
//	終了関数
//
//===================================
void CGearCaterpillarComponent::End()
{

}

