//======================================================================
//												CLiftPoint.cpp
//	リフトポイント
//
//======================================================================
//	author :	AT12A 05 宇佐美晃之
//======================================================================
//	開発履歴
//	2020/12/10	作成
//
//======================================================================


//===== インクルード部 =====
#include "CLiftPoint.h"


//===== マクロ定義 =====
#define DEFAULT_MODEL			"data/model/Lift_Line/Gear.fbx"
#define TEXTURE_PATH			"data/model/Lift_Line/Giar_Tex2.png"


//===== プロトタイプ宣言 =====


//===== グローバル変数 =====


//===================================
//
//	コンストラクタ
//
//===================================
CLiftPoint::CLiftPoint()
{
	// トランスフォーム
	//m_pTrans->SetScale({ 25.0f,25.0f,25.0f });

	// タグの設定
	m_name = m_tag = "LiftPoint";

	// モデルのロード
	m_renderer.lock()->ModelLoad(DEFAULT_MODEL);
	m_renderer.lock()->SetDiffuseTexture(TEXTURE_PATH);

	//--- コンポーネントの追加

}

//===================================
//
//	デストラクタ
//
//===================================
CLiftPoint::~CLiftPoint()
{

}


