//======================================================================
//												CStandStick.cpp
//	Assimpモデルベースのオブジェクトレイアウト
//
//======================================================================
//	author :	AT12A 05 宇佐美晃之
//======================================================================
//	開発履歴
//	2020/11/16	作成
//
//======================================================================


//===== インクルード部 =====
#include "CStandStick.h"
#include "CCollision2D.h"
#include "CRigidbody2D.h"
#include "CStandStickComponent.h"

//===== マクロ定義 =====
#define DEFAULT_MODEL			"data/model/box.fbx"


//===== プロトタイプ宣言 =====


//===== グローバル変数 =====


//===================================
//
//	コンストラクタ
//
//===================================
CStandStick::CStandStick()
{
	// トランスフォーム
	m_pTrans;

	// タグの設定
	m_tag = "StandStick";

	//--- コンポーネントの追加
	const auto& col = AddComponent<CCollision2D>();
	AddComponent<CStandStickComponent>();

	col->SetScale({ 20.0f,20.0f,20.0f });
	col->SetOffSet({ 0.0f,-50.0f,0.0f });
}

//===================================
//
//	デストラクタ
//
//===================================
CStandStick::~CStandStick()
{

}
