//======================================================================
//												CSwitch.h
//	Assimpモデルベースのオブジェクトレイアウト
//
//======================================================================
//	author :	AT12A 18 田村敏基
//======================================================================
//	開発履歴
//	2020/11/20	作成
//
//======================================================================
#pragma once


//====== インクルード部 ======
#include "CAssimpObject.h"


//===== 構造体定義 =====


//===== クラス定義 =====
class CSwitch : public CAssimpObject
{
public:
	CSwitch();
	~CSwitch();
protected:

private:
};


//===== プロトタイプ宣言 =====


