//======================================================================
//												CTitleMenuObj.cpp
//	タイトルメニュー用のオブジェクト
//
//======================================================================
//	author :	AT12A 15 榊原龍我
//======================================================================
//	開発履歴
//	2021/01/20 作成
//
//======================================================================


//===== インクルード部 =====
#include "CTitleMenuObj.h"

#include "CMenuComponent.h"

//===== マクロ定義 =====
#define DEFAULT_MODEL			"data/model/box.fbx"
#define TEXTURE_PATH			"NONE"

//===== プロトタイプ宣言 =====


//===== グローバル変数 =====


//===================================
//
//	コンストラクタ
//
//===================================
CTitleMenuObj::CTitleMenuObj()
{
	// トランスフォーム
	m_pTrans;

	// タグの設定
	m_name = m_tag = "TitleMenu";

	//--- コンポーネントの追加
	AddComponent<CMenuComponent>();

	
}

//===================================
//
//	デストラクタ
//
//===================================
CTitleMenuObj::~CTitleMenuObj()
{

}
