//======================================================================
//												CBrokenObject.h
//	Assimpモデルベースのオブジェクトレイアウト
//
//======================================================================
//	author :	AT12A 20 土屋美月
//======================================================================
//	開発履歴
//	2020/12/03	作成
//
//======================================================================
#pragma once


//====== インクルード部 ======
#include "CAssimpObject.h"


//===== 構造体定義 =====


//===== クラス定義 =====
class CBrokenObject : public CAssimpObject
{
public:
	CBrokenObject();
	~CBrokenObject();
protected:

private:

};


//===== プロトタイプ宣言 =====



