//======================================================================
//												CDamegeTrapPoint.h
//	ダメージトラップ
//
//======================================================================
//	author :	AT12A 15 榊原龍我
//======================================================================
//	開発履歴
//	2020/12/13	作成
//
//======================================================================
#pragma once


//====== インクルード部 ======
#include "CAssimpObject.h"


//===== 構造体定義 =====


//===== クラス定義 =====
class CDamegeTrapPoint : public CAssimpObject
{
public:
	CDamegeTrapPoint();
	~CDamegeTrapPoint();
protected:

private:
};


//===== プロトタイプ宣言 =====