//======================================================================
//												CDebugObject.h
//	デバック用オブジェクト
//
//======================================================================
//	author :	AT12A 05 宇佐美晃之
//======================================================================
//	開発履歴
//	2020/11/26	作成
//
//======================================================================
#pragma once


//====== インクルード部 ======
#include "CBillboardObject.h"
#include "CSpriteObject.h"


//===== 構造体定義 =====


//===== クラス定義 =====
class CDebugObject : public CObject
{
public:
	CDebugObject();
	~CDebugObject();
protected:

private:
};


//===== プロトタイプ宣言 =====


