//======================================================================
//												CDoor.h
//	Assimpモデルベースのオブジェクトレイアウト
//
//======================================================================
//	author :	AT12A 05 宇佐美晃之
//======================================================================
//	開発履歴
//	2020/11/16	作成
//
//======================================================================
#pragma once


//====== インクルード部 ======
#include "CAssimpObject.h"


//===== 構造体定義 =====


//===== クラス定義 =====
class CDoor : public CAssimpObject
{
public:
	CDoor();
	~CDoor();

protected:

private:
};


//===== プロトタイプ宣言 =====


