//======================================================================
//												CEditorModeObj.cpp
//	タイトルのエディターモード用オブジェクト
//
//======================================================================
//	author :	AT12A 15 榊原龍我
//======================================================================
//	開発履歴
//	2021/01/19	作成
//
//======================================================================


//===== インクルード部 =====
#include "CEditorModeObj.h"


//===== マクロ定義 =====
#define DEFAULT_MODEL			"data/model/box.fbx"
#define TEXTURE_PATH			"data/texture/Title_Menu/hatena.png"

//===== プロトタイプ宣言 =====


//===== グローバル変数 =====


//===================================
//
//	コンストラクタ
//
//===================================
CEditorModeObj::CEditorModeObj()
{
	// トランスフォーム
	m_pTrans;

	// タグの設定
	m_name = m_tag = "CEditorModeObj";

	//--- コンポーネントの追加

	//テクスチャの設定
	m_renderer.lock()->SetTexture(TEXTURE_PATH);

}

//===================================
//
//	デストラクタ
//
//===================================
CEditorModeObj::~CEditorModeObj()
{

}
