//======================================================================
//												CEditorObject.h
//	エディターのオブジェクト
//
//======================================================================
//	author :	AT12A 12 紀平
//======================================================================
//	開発履歴
//	2020/12/03	作成
//				紀平から引き継ぎ/榊原
//======================================================================
#pragma once


//====== インクルード部 ======
#include "CAssimpObject.h"

//===== 構造体定義 =====


//===== クラス定義 =====
class CEditorObject : public CAssimpObject
{
public:
	CEditorObject();
	~CEditorObject();
protected:

private:
};


//===== プロトタイプ宣言 =====


