//======================================================================
//												CElevatorRoad.h
//	エレベーターロード
//
//======================================================================
//	author :	AT12A 05 宇佐美晃之
//======================================================================
//	開発履歴
//	2020/12/05	作成
//
//======================================================================
#pragma once


//====== インクルード部 ======
#include "CAssimpObject.h"


//===== 構造体定義 =====


//===== クラス定義 =====
class CElevatorRoad : public CAssimpObject
{
public:
	CElevatorRoad();
	~CElevatorRoad();
protected:

private:
	
}; 


//===== プロトタイプ宣言 =====


#pragma once
