//======================================================================
//												CEndingObj.h
//	エンディングの背景用オブジェクト
//
//======================================================================
//	author :	AT12A 15 榊原龍我
//======================================================================
//	開発履歴
//	2021/01/22	作成
//
//======================================================================
#pragma once


//====== インクルード部 ======
#include "CSpriteObject.h"


//===== 構造体定義 =====


//===== クラス定義 =====
class CEndingObj : public CSpriteObject
{
public:
	CEndingObj();
	~CEndingObj();
protected:

private:

};


//===== プロトタイプ宣言 =====


