//======================================================================
//												CEndingObj.cpp
//	Assimpモデルベースのオブジェクトレイアウト
//
//======================================================================
//	author :	AT12A 15 榊原龍我
//======================================================================
//	開発履歴
//	2021/01/22	作成
//
//======================================================================


//===== インクルード部 =====
#include "CEndingObj.h"
#include "CEndingFadeComponent.h"

//===== マクロ定義 =====
#define DEFAULT_MODEL			"data/model/box.fbx"

#define TEXTURE_PATH			"NONE"

//===== プロトタイプ宣言 =====


//===== グローバル変数 =====


//===================================
//
//	コンストラクタ
//
//===================================
CEndingObj::CEndingObj()
{
	// トランスフォーム
	m_pTrans;

	// タグの設定
	m_name = m_tag = "CEnding";

	//--- コンポーネントの追加
	AddComponent<CEndingFadeComponent>();

}

//===================================
//
//	デストラクタ
//
//===================================
CEndingObj::~CEndingObj()
{

}
