//======================================================================
//												CEndElevator.h
//	エンドエレベーター
//
//======================================================================
//	author :	AT12A 05 宇佐美晃之
//======================================================================
//	開発履歴
//	2020/12/03	作成
//
//======================================================================
#pragma once


//====== インクルード部 ======
#include "CAssimpObject.h"


//===== 構造体定義 =====


//===== クラス定義 =====
class CEndElevator : public CAssimpObject
{
public:
	CEndElevator();
	~CEndElevator();
protected:

private:
	
}; 


//===== プロトタイプ宣言 =====


#pragma once
