//======================================================================
//												CEnergyBullet.h
//	エネルギー弾
//
//======================================================================
//	author :	AT12A 15 榊原龍我
//======================================================================
//	開発履歴
//	2020/11/16	作成
//
//======================================================================
#pragma once


//====== インクルード部 ======
#include "CBillboardObject.h"


//===== 構造体定義 =====


//===== クラス定義 =====
class CEnergyBullet : public CBillboardObject
{
public:
	CEnergyBullet();
	~CEnergyBullet();
protected:

private:
};


//===== プロトタイプ宣言 =====


