//======================================================================
//												CExitObj.h
//	タイトルメニューの終了用オブジェクト
//
//======================================================================
//	author :	AT12A 15 榊原龍我
//======================================================================
//	開発履歴
//	2020/11/19	作成
//
//======================================================================
#pragma once


//====== インクルード部 ======
#include "CSpriteObject.h"
#include "CSpriteRenderer.h"


//===== 構造体定義 =====


//===== クラス定義 =====
class CExitObj : public CSpriteObject
{
public:
	CExitObj();
	~CExitObj();
protected:

private:
};


//===== プロトタイプ宣言 =====


