//======================================================================
//												CFadeObject.h
//	フェードオブジェクト
//
//======================================================================
//	author :	AT12A 05 宇佐美晃之
//======================================================================
//	開発履歴
//	2020/12/06	作成
//
//======================================================================
#pragma once


//====== インクルード部 ======
#include "CSpriteObject.h"


//===== 構造体定義 =====


//===== クラス定義 =====
class CFadeObject : public CSpriteObject
{
public:
	CFadeObject();
	~CFadeObject();
protected:

private:
};


//===== プロトタイプ宣言 =====


