//======================================================================
//												CFallObject.h
//	プレイヤーがのったらきえるやつ
//
//======================================================================
//	author :	AT12A 20 土屋美月
//======================================================================
//	開発履歴
//	2020/12/08	作成
//
//======================================================================
#pragma once


//====== インクルード部 ======
#include "CAssimpObject.h"


//===== 構造体定義 =====


//===== クラス定義 =====
class CFallObject : public CAssimpObject
{
public:
	CFallObject();
	~CFallObject();
protected:

private:
};


//===== プロトタイプ宣言 =====



