//======================================================================
//												CGameStartObj.cpp
//	タイトルメニューのゲーム開始用オブジェクト
//
//======================================================================
//	author :	AT12A 15 榊原龍我
//======================================================================
//	開発履歴
//	2021/01/19 作成
//
//======================================================================


//===== インクルード部 =====
#include "CGameStartObj.h"


//===== マクロ定義 =====
#define DEFAULT_MODEL			"data/model/box.fbx"
#define TEXTURE_PATH			"data/texture/Title_Menu/START.png"

//===== プロトタイプ宣言 =====


//===== グローバル変数 =====


//===================================
//
//	コンストラクタ
//
//===================================
CGameStartObj::CGameStartObj()
{
	// トランスフォーム
	m_pTrans;

	// タグの設定
	m_name = m_tag = "CGameStartObj";

	//--- コンポーネントの追加
	

	//テクスチャ読み込み
	m_renderer.lock()->SetTexture(TEXTURE_PATH);



}

//===================================
//
//	デストラクタ
//
//===================================
CGameStartObj::~CGameStartObj()
{

}
