//======================================================================
//												CGameManagerObject.cpp
//	Assimpモデルベースのオブジェクトレイアウト
//
//======================================================================
//	author :	AT12A 05 宇佐美晃之
//======================================================================
//	開発履歴
//	2020/11/16	作成
//
//======================================================================


//===== インクルード部 =====
#include "CGameManagerObject.h"

#include "CTestComponent.h"


//===== マクロ定義 =====


//===== プロトタイプ宣言 =====


//===== グローバル変数 =====


//===================================
//
//	コンストラクタ
//
//===================================
CGameManagerObject::CGameManagerObject()
{
	// トランスフォーム
	m_pTrans;

	// タグの設定
	m_name = m_tag = "GameManager";


	//--- コンポーネントの追加
	AddComponent<CTestComponent>();

}

//===================================
//
//	デストラクタ
//
//===================================
CGameManagerObject::~CGameManagerObject()
{

}
