//======================================================================
//												CLiftPoint.h
//	リフトポイント
//
//======================================================================
//	author :	AT12A 05 宇佐美晃之
//======================================================================
//	開発履歴
//	2020/12/10	作成
//
//======================================================================
#pragma once


//====== インクルード部 ======
#include "CAssimpObject.h"


//===== 構造体定義 =====


//===== クラス定義 =====
class CLiftPoint : public CAssimpObject
{
public:
	CLiftPoint();
	~CLiftPoint();
protected:

private:
};


//===== プロトタイプ宣言 =====


