//======================================================================
//												CMagnetBlock.h
//	電磁石ブロック
//
//======================================================================
//	author :	AT12A 18 田村敏基
//======================================================================
//	開発履歴
//	2020/11/16	作成
//
//======================================================================
#pragma once


//====== インクルード部 ======
#include "CAssimpObject.h"


//===== 構造体定義 =====


//===== クラス定義 =====
class CMagnetBlock : public CAssimpObject
{
public:
	CMagnetBlock();
	~CMagnetBlock();
protected:

private:

};


//===== プロトタイプ宣言 =====
