//==================================================================
//								CSceneGame.h
//	ゲームシーン
//
//==================================================================
//	author :	AT12A 05 宇佐美晃之
//==================================================================
//	開発履歴
//
//	2020/12/14	作成
//
//===================================================================
#pragma once


//====== インクルード部 ======
#include "CScene.h"

//===== クラス定義 =====
class CSceneGame : public CScene
{
public:
	CSceneGame();
	~CSceneGame();

	// 四大処理
	virtual void Init();
	virtual void Uninit();
	virtual void Update();
	virtual void Draw();

private:

};


