//======================================================================
//												CStandStick.h
//	Assimpモデルベースのオブジェクトレイアウト
//
//======================================================================
//	author :	AT12A 05 宇佐美晃之
//======================================================================
//	開発履歴
//	2020/11/16	作成
//
//======================================================================
#pragma once


//====== インクルード部 ======
#include "CAssimpObject.h"


//===== 構造体定義 =====


//===== クラス定義 =====
class CStandStick : public CAssimpObject
{
public:
	CStandStick();
	~CStandStick();
protected:

private:
};


//===== プロトタイプ宣言 =====


