//======================================================================
//												CTitleMenuObj.h
//	タイトルメニューのオブジェクト
//
//======================================================================
//	author :	AT12A 15 榊原龍我
//======================================================================
//	開発履歴
//	2021/01/20	作成
//
//======================================================================
#pragma once


//====== インクルード部 ======
#include "CSpriteObject.h"


//===== 構造体定義 =====


//===== クラス定義 =====
class CTitleMenuObj : public CSpriteObject
{
public:
	CTitleMenuObj();
	~CTitleMenuObj();
protected:

private:

};


//===== プロトタイプ宣言 =====


